benchmark/ycsb/results/tmp/docker_x.txt
/home/kernux/.jdks/azul-1.8.0_322/bin/java  -classpath /home/kernux/Documents/thesis/app-redis/benchmark/ycsb/conf:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/HdrHistogram-2.1.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/commons-pool2-2.4.2.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/core-0.17.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jedis-2.9.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/kernux/Documents/thesis/app-redis/benchmark/ycsb/workloads/thesis -p redis.host=172.19.0.2 -p redis.port=6379
[OVERALL], RunTime(ms), 149
[OVERALL], Throughput(ops/sec), 6711.4093959731545
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 76
[READ], AverageLatency(us), 56.10526315789474
[READ], MinLatency(us), 32
[READ], MaxLatency(us), 150
[READ], 95thPercentileLatency(us), 100
[READ], 99thPercentileLatency(us), 119
[READ], Return=OK, 76
[READ], Return=ERROR, 419
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 341.0
[CLEANUP], MinLatency(us), 341
[CLEANUP], MaxLatency(us), 341
[CLEANUP], 95thPercentileLatency(us), 341
[CLEANUP], 99thPercentileLatency(us), 341
[INSERT], Operations, 505
[INSERT], AverageLatency(us), 147.0970297029703
[INSERT], MinLatency(us), 66
[INSERT], MaxLatency(us), 6879
[INSERT], 95thPercentileLatency(us), 267
[INSERT], 99thPercentileLatency(us), 486
[INSERT], Return=OK, 505
[READ-FAILED], Operations, 419
[READ-FAILED], AverageLatency(us), 50.79952267303103
[READ-FAILED], MinLatency(us), 21
[READ-FAILED], MaxLatency(us), 5759
[READ-FAILED], 95thPercentileLatency(us), 68
[READ-FAILED], 99thPercentileLatency(us), 118