benchmark/ycsb/results/tmp/unikernel_x.txt
/home/kernux/.jdks/azul-1.8.0_322/bin/java  -classpath /home/kernux/Documents/thesis/app-redis/benchmark/ycsb/conf:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/HdrHistogram-2.1.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/commons-pool2-2.4.2.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/core-0.17.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-core-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/jedis-2.9.0.jar:/home/kernux/Documents/thesis/app-redis/benchmark/ycsb/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/kernux/Documents/thesis/app-redis/benchmark/ycsb/workloads/thesis -p redis.host=192.168.1.20 -p redis.port=6379
[OVERALL], RunTime(ms), 221
[OVERALL], Throughput(ops/sec), 4524.886877828054
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 76
[READ], AverageLatency(us), 85.63157894736842
[READ], MinLatency(us), 55
[READ], MaxLatency(us), 190
[READ], 95thPercentileLatency(us), 128
[READ], 99thPercentileLatency(us), 156
[READ], Return=OK, 76
[READ], Return=ERROR, 408
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 355.0
[CLEANUP], MinLatency(us), 355
[CLEANUP], MaxLatency(us), 355
[CLEANUP], 95thPercentileLatency(us), 355
[CLEANUP], 99thPercentileLatency(us), 355
[INSERT], Operations, 516
[INSERT], AverageLatency(us), 247.83527131782947
[INSERT], MinLatency(us), 106
[INSERT], MaxLatency(us), 8487
[INSERT], 95thPercentileLatency(us), 522
[INSERT], 99thPercentileLatency(us), 1042
[INSERT], Return=OK, 516
[READ-FAILED], Operations, 408
[READ-FAILED], AverageLatency(us), 77.30637254901961
[READ-FAILED], MinLatency(us), 40
[READ-FAILED], MaxLatency(us), 5267
[READ-FAILED], 95thPercentileLatency(us), 116
[READ-FAILED], 99thPercentileLatency(us), 176